In [285]:
import pandas as pd
import numpy as np
import statsmodels.api as sm
from statsmodels.formula.api import ols

from sklearn.preprocessing import LabelEncoder
from sklearn.model_selection import train_test_split as tts

from sklearn.preprocessing import StandardScaler, MinMaxScaler  
from sklearn.decomposition import PCA

from sklearn.preprocessing import StandardScaler

from sklearn.metrics import mean_squared_error as mse
from sklearn.metrics import r2_score as r2

from sklearn.linear_model import LinearRegression as LinReg
from sklearn.linear_model import Lasso        # regularizacion L1
from sklearn.linear_model import Ridge        # regularizacion L2
from sklearn.linear_model import ElasticNet

from sklearn.linear_model import LogisticRegression as LogReg

from sklearn.svm import SVR
from sklearn.ensemble import RandomForestRegressor as RFR  
from sklearn.tree import ExtraTreeRegressor as ETR
from sklearn.ensemble import GradientBoostingRegressor as GBR
from xgboost import XGBRegressor as XGBR
from lightgbm import LGBMRegressor as LGBMR
from sklearn.model_selection import GridSearchCV
from hyperopt import fmin, hp, tpe, Trials, space_eval, STATUS_OK

In [263]:
def ml():
    
    models = {'LinReg:{'MODEL':LinReg(), 'PARAMS':{'N:HBBVIBVNO'}}, 'Lasso':Lasso(), 'Ridge':Ridge(), 'Elastic':ElasticNet(), 'LogReg':LogReg(), 'RFR':RFR(), 
               'ETR':ETR(), 'SVR':SVR(), 'XGBR':XGBR(), 'GBR':GBR(), 'LGBMR':LGBMR()}
    
    rmse = []
    name = []
    dfmodels = pd.DataFrame()
    for m in models:
        x = models[m]["MODEL"]
        p = models[m]["PARAM"]
        y_pred=grid(x,p).predict(X_test)
        MSE = mse(y_test, y_pred, squared=False)
        rmse.append(MSE)
        name.append(m)
    dfmodels['Modelo'] = name
    dfmodels['RMSE'] = rmse
    dfmodels.sort_values("RMSE",ascending=True,inplace=True,ignore_index=True)
    print(f'optimum model {dfmodels.Modelo[0]} min rmse {dfmodels.RMSE[0]}')
    return dfmodels

In [278]:
def grid(modelo, param):
    
    g=GridSearchCV(modelo, # modelo de sklearn
                   param,  # dictio de parametros
                   cv=5,   # nÂº de cortes del cross-validation
                   return_train_score=True, # error en entrenamiento para checkear
                   n_jobs=-1  # usa todos los nucleos disponibles
                  )

    g.fit(X_train, y_train)

   

    return g.best_estimator_.fit(X_train, y_train)

In [271]:
rfr = RFR()

In [272]:
grid(rfr,param)

Acierto test: 0.27
Acierto train: 0.64
Mejores parametros: {'max_depth': 5, 'n_estimators': 50}
Mejor acierto cv: 0.46

RandomForestRegressor(max_depth=5, n_estimators=50)

In [363]:
salaries=pd.read_csv(r'data/salaries_data.csv')
testeo=pd.read_csv(r'data/testeo.csv')
muestra=pd.read_csv(r'data/muestra.csv')

In [180]:
salaries.head()

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2022,SE,FT,Data Engineer,140250,USD,140250,US,100,US,M
1,2022,SE,FT,Data Engineer,135000,USD,135000,US,100,US,M
2,2021,MI,FT,BI Data Analyst,100000,USD,100000,US,100,US,M
3,2021,MI,CT,ML Engineer,270000,USD,270000,US,100,US,L
4,2021,MI,FT,Data Engineer,22000,EUR,26005,RO,0,US,L

In [181]:
salaries.work_year.unique()

array([2022, 2021, 2020], dtype=int64)

In [182]:
salaries.experience_level.unique()

array(['SE', 'MI', 'EN', 'EX'], dtype=object)

In [183]:
salaries.job_title.unique()[0]

'Data Engineer'

In [184]:
salaries.job_title.value_counts()

Data Scientist                              121
Data Engineer                               111
Data Analyst                                 81
Machine Learning Engineer                    31
Research Scientist                           12
Data Science Manager                         12
Data Architect                                8
Machine Learning Scientist                    7
Data Analytics Manager                        7
Big Data Engineer                             7
Director of Data Science                      7
ML Engineer                                   6
Lead Data Engineer                            6
Principal Data Scientist                      6
Applied Data Scientist                        5
Data Engineering Manager                      5
Data Science Consultant                       5
AI Scientist                                  5
BI Data Analyst                               5
Head of Data                                  4
Business Data Analyst                         4
Computer Vision Engineer                      4
Analytics Engineer                            3
Lead Data Scientist                           3
Applied Machine Learning Scientist            3
Cloud Data Engineer                           2
Machine Learning Infrastructure Engineer      2
Lead Data Analyst                             2
Data Analytics Engineer                       2
Director of Data Engineering                  2
ETL Developer                                 2
Head of Data Science                          2
Machine Learning Developer                    2
Data Science Engineer                         2
Machine Learning Manager                      1
Staff Data Scientist                          1
Head of Machine Learning                      1
Finance Data Analyst                          1
Financial Data Analyst                        1
Data Analytics Lead                           1
3D Computer Vision Researcher                 1
Principal Data Analyst                        1
Product Data Analyst                          1
Big Data Architect                            1
Data Specialist                               1
Lead Machine Learning Engineer                1
Marketing Data Analyst                        1
Computer Vision Software Engineer             1
Name: job_title, dtype: int64

In [185]:
salaries[salaries.job_title=="Data Scientist"].salary_in_usd.mean()

110782.44628099173

In [186]:
dicti = {}
for i in salaries.job_title.unique():
    mean= salaries[salaries.job_title==f"{i}"].salary_in_usd.mean()
    dicti[i]=mean

In [187]:
sorted_dicti = sorted(dicti.items(), key=lambda kv: kv[1],reverse = True)

In [188]:
import collections

sorted_dict = collections.OrderedDict(sorted_dicti)

In [189]:
sorted_dict

OrderedDict([('Financial Data Analyst', 450000.0),
             ('Data Analytics Lead', 405000.0),
             ('Principal Data Scientist', 214449.5),
             ('Director of Data Science', 195074.0),
             ('Applied Machine Learning Scientist', 178800.0),
             ('Data Architect', 175934.25),
             ('Applied Data Scientist', 175655.0),
             ('Principal Data Analyst', 170000.0),
             ('Head of Data Science', 167000.0),
             ('Data Specialist', 165000.0),
             ('Analytics Engineer', 164900.0),
             ('Data Science Manager', 158328.5),
             ('Director of Data Engineering', 156738.0),
             ('Machine Learning Scientist', 143900.0),
             ('Head of Data', 142703.25),
             ('Lead Data Engineer', 139724.5),
             ('Data Analytics Manager', 127134.28571428571),
             ('Cloud Data Engineer', 124647.0),
             ('Data Engineering Manager', 123227.2),
             ('Machine Learning Engineer', 117583.12903225806),
             ('ML Engineer', 117504.0),
             ('Machine Learning Manager', 117104.0),
             ('Lead Data Scientist', 115190.0),
             ('Data Engineer', 111636.2072072072),
             ('Data Scientist', 110782.44628099173),
             ('Staff Data Scientist', 105000.0),
             ('Research Scientist', 99953.58333333333),
             ('Big Data Architect', 99703.0),
             ('Lead Data Analyst', 94804.5),
             ('Data Analyst', 92154.55555555556),
             ('Business Data Analyst', 91253.5),
             ('Marketing Data Analyst', 88654.0),
             ('Lead Machine Learning Engineer', 87932.0),
             ('Data Science Engineer', 83705.0),
             ('BI Data Analyst', 82454.4),
             ('Head of Machine Learning', 79039.0),
             ('Machine Learning Developer', 78791.0),
             ('Computer Vision Software Engineer', 70000.0),
             ('Data Science Consultant', 67874.2),
             ('Finance Data Analyst', 61896.0),
             ('AI Scientist', 59410.6),
             ('Big Data Engineer', 57080.57142857143),
             ('ETL Developer', 54957.0),
             ('Machine Learning Infrastructure Engineer', 54217.5),
             ('Data Analytics Engineer', 35000.0),
             ('Computer Vision Engineer', 28226.75),
             ('Product Data Analyst', 20000.0),
             ('3D Computer Vision Researcher', 5409.0)])

In [190]:
salaries[salaries.job_title=="3D Computer Vision Researcher"]

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
62,2021,MI,PT,3D Computer Vision Researcher,400000,INR,5409,IN,50,IN,M

In [191]:
salaries[salaries.job_title=="Product Data Analyst"]

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
282,2020,MI,FT,Product Data Analyst,20000,USD,20000,HN,0,HN,S

In [192]:

salaries[salaries.job_title=="Financial Data Analyst"]

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
370,2021,MI,FT,Financial Data Analyst,450000,USD,450000,US,100,US,L

In [193]:
salaries.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 500 entries, 0 to 499
Data columns (total 11 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   work_year           500 non-null    int64
 1   experience_level    500 non-null    object
 2   employment_type     500 non-null    object
 3   job_title           500 non-null    object
 4   salary              500 non-null    int64
 5   salary_currency     500 non-null    object
 6   salary_in_usd       500 non-null    int64
 7   employee_residence  500 non-null    object
 8   remote_ratio        500 non-null    int64
 9   company_location    500 non-null    object
 10  company_size        500 non-null    object
dtypes: int64(4), object(7)
memory usage: 43.1+ KB

In [195]:
# We can see the salaries vary greatly between employee residence, like in diamond color we will create weighted values
salaries[salaries.employee_residence== "US"].salary_in_usd.mean()

149849.12230215827

In [196]:
# We will transform employee residence to a normalized average of the salaries per country
#for e,i in enumerate(salaries.employee_residence):
    #salaries.employee_residence[e]=salaries[salaries.employee_residence== i].salary_in_usd.mean()

In [200]:
job = salaries[salaries.job_title=="Data Engineer"]

In [69]:
job[job.experience_level== "EN"].salary.mean()

962311.1111111111

In [73]:
salaries["job_title"].value_counts().head(10).index

Index(['Data Scientist', 'Data Engineer', 'Data Analyst',
       'Machine Learning Engineer', 'Research Scientist',
       'Data Science Manager', 'Data Architect', 'Machine Learning Scientist',
       'Data Analytics Manager', 'Big Data Engineer'],
      dtype='object')

In [70]:
def resumir(column,hlength,df):
    peak = df[column].value_counts().head(hlength).index
    lista = []
    for g in df[column]:
        if g in peak:
            lista.append(g)
        else:
            lista.append('other')

    df[column] = lista
    
    return i

In [168]:
salaries.head()

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2022,SE,FT,Data Engineer,140250,USD,140250,US,100,US,M
1,2022,SE,FT,Data Engineer,135000,USD,135000,US,100,US,M
2,2021,MI,FT,BI Data Analyst,100000,USD,100000,US,100,US,M
3,2021,MI,CT,ML Engineer,270000,USD,270000,US,100,US,L
4,2021,MI,FT,Data Engineer,22000,EUR,26005,RO,0,US,L

In [364]:
average = {"US":54132,"FR":41379,"GR":17093,"LU": 75305,"SI":29460,"DE":45485,"IN":4766,"GB":40519,"PK":4379,"MD":6480,"JP":45000,"CA":40000,"AS":52626,"IE":40000,"AE":50000,"MX":20000,"VN":2400,"BE":44300,"KE":7608,"ES":36000,"CH":50000,"CL":27816,"CN":16716,"DK":40000,"RO":8360,"MY":18877,"PR":33000,"HU":17640,"PT": 31200,"BG":22263, "HN": 14000,"TR":8400,"AU": 52338,"UA":10000,"NG":9000,"BR":19000,"NL":50000,"HK":56000,"SG":60000,"IR":6000,"NZ":61000,"RS":16800,"JE":60000,"RU":18000,"EE":22000,"CZ":26000,"AT":45000,"BO":6000,"PL":23000,"IT":38000,"MT":30000,"DZ":7000,"HR":12000,"PH":13000,"IQ":5500,"CO":12000,"AR":20000,"TN":6000,"IL":42000}

In [366]:
lst1 = []
lst2 = []
for i in average.keys():
    lst1.append(i)
    lst2.append(average[i])

In [367]:
data1 = {"cc":lst1,"salary":lst2}

In [368]:
salary = pd.DataFrame(data= data1)

In [207]:
for i,e in enumerate(salaries.employee_residence):
    f = salary[salary.cc==e].salary
    f = int(f)
    salaries.employee_residence[i]=f

C:\Users\pabli\anaconda3\envs\clase\lib\site-packages\ipykernel_launcher.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  after removing the cwd from sys.path.

In [209]:
for i,e in enumerate(salaries.company_location):
    f = salary[salary.cc==e].salary
    f = int(f)
    salaries.company_location[i]=f

C:\Users\pabli\anaconda3\envs\clase\lib\site-packages\ipykernel_launcher.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  after removing the cwd from sys.path.

In [211]:
numeric1 = ['work_year', 'remote_ratio','employee_residence',"company_location"] # Our only numeric columns to transform are work year and remote ratio due to the salary being the objective variable.

In [212]:
from sklearn.preprocessing import StandardScaler

scaler=StandardScaler()

salaries[numeric1]=scaler.fit_transform(salaries[numeric1])

salaries.head()

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,0.857874,SE,FT,Data Engineer,140250,USD,140250,0.653275,0.697464,0.586726,M
1,0.857874,SE,FT,Data Engineer,135000,USD,135000,0.653275,0.697464,0.586726,M
2,-0.606075,MI,FT,BI Data Analyst,100000,USD,100000,0.653275,0.697464,0.586726,M
3,-0.606075,MI,CT,ML Engineer,270000,USD,270000,0.653275,0.697464,0.586726,L
4,-0.606075,MI,FT,Data Engineer,22000,EUR,26005,-2.260379,-1.775814,0.586726,L

In [222]:
for i in salaries.job_title:
    if 'Engineer' in i:
        salaries.job_title.replace({i: 'Data Engineer'}, inplace = True)
    elif 'Analy' in i:
        salaries.job_title.replace({i: 'Data Analyst'}, inplace = True)
    elif 'Architect' in i:
        salaries.job_title.replace({i: 'Data Architect'}, inplace = True)
    elif 'Scien' in i:
        salaries.job_title.replace({i: 'Data Scientist'}, inplace = True)

In [223]:
salaries.job_title.value_counts()

Data Scientist                   189
Data Engineer                    185
Data Analyst                     105
Data Architect                     9
Head of Data                       4
Machine Learning Developer         2
ETL Developer                      2
Machine Learning Manager           1
3D Computer Vision Researcher      1
Data Specialist                    1
Head of Machine Learning           1
Name: job_title, dtype: int64

In [225]:
salaries.drop(columns=["salary","salary_currency"],inplace=True)

In [227]:
from sklearn.preprocessing import LabelEncoder

for i in list(salaries.select_dtypes(exclude=["int64", 'float64']).columns):
    salaries[i] = LabelEncoder().fit_transform(salaries[i])
    
salaries

,work_year,experience_level,employment_type,job_title,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,0.857874,3,2,3,140250,0.653275,0.697464,0.586726,1
1,0.857874,3,2,3,135000,0.653275,0.697464,0.586726,1
2,-0.606075,2,2,1,100000,0.653275,0.697464,0.586726,1
3,-0.606075,2,0,3,270000,0.653275,0.697464,0.586726,0
4,-0.606075,2,2,3,26005,-2.260379,-1.775814,0.586726,0
...,...,...,...,...,...,...,...,...,...
495,0.857874,3,2,3,100000,0.653275,0.697464,0.586726,1
496,-0.606075,0,2,3,5882,-2.489158,-1.775814,0.293828,0
497,0.857874,3,2,2,90700,-0.246309,0.697464,-0.415023,1
498,-0.606075,2,2,3,82528,-0.213271,0.697464,-0.378233,0
499,-0.606075,0,2,3,70000,0.653275,0.697464,0.586726,1

In [228]:
X = salaries.drop('salary_in_usd', axis=1)

y = salaries.salary_in_usd

X.head()

,work_year,experience_level,employment_type,job_title,employee_residence,remote_ratio,company_location,company_size
0,0.857874,3,2,3,0.653275,0.697464,0.586726,1
1,0.857874,3,2,3,0.653275,0.697464,0.586726,1
2,-0.606075,2,2,1,0.653275,0.697464,0.586726,1
3,-0.606075,2,0,3,0.653275,0.697464,0.586726,0
4,-0.606075,2,2,3,-2.260379,-1.775814,0.586726,0

In [261]:
from sklearn.model_selection import train_test_split as tts

X_train, X_test, y_train, y_test = tts(X, y, train_size=0.8, test_size=0.2, random_state=42)

X_train.shape, X_test.shape, y_train.shape, y_test.shape

((400, 8), (100, 8), (400,), (100,))

array([162825.75897691,  64435.        , 128591.95216667, 110410.56058357,
       110410.56058357,  70499.99      ,  79506.74      , 215614.35819092,
        84196.68428571,  52111.91      ,  51797.89666667,  36080.01333333,
       146012.08637615, 228444.95565546, 152199.51509171,  68683.82508333,
       146012.08637615,  62317.73      ,  69577.56833333,  98286.32466667,
        37481.62108333, 114599.83333333,  64787.14366667,  61250.33066667,
        71346.77      , 231131.375     , 158302.37      , 159697.76089294,
        67428.37666667, 125738.33333333, 146012.08637615,  17845.57      ,
       159422.33392857, 152199.51509171, 144145.74979167, 110410.56058357,
        85554.91      ,  57514.422     , 199731.68759019, 171011.13690476,
       159697.76089294, 116558.94047619,  85520.14      ,  79911.65485714,
        51168.0025    ,  49895.20166667, 146012.08637615, 146012.08637615,
       150204.89542125, 146012.08637615, 122962.36640351, 152199.51509171,
        55463.13583333, 146012.08637615, 138161.42      , 110410.56058357,
        61718.1285119 ,  23357.66      ,  24625.22      , 193147.80574892,
       159697.76089294, 159697.76089294, 126316.47113997,  92643.3950119 ,
        74551.01      , 102923.454     , 280855.37772553,  71393.89309524,
       246488.00934524, 227056.21756022, 110364.24136558, 106623.37775253,
       146012.08637615, 101152.11272727, 122839.3011407 , 110410.56058357,
        23735.39      ,  66163.56933333, 112253.45201465,  63742.74933333,
       146012.08637615, 144145.74979167, 146012.08637615,  51980.36      ,
       170274.88470696,  43897.07833333,  99739.31      ,  92643.3950119 ,
       190196.8452381 ,  47164.9       , 159422.33392857,  32816.543     ,
       110410.56058357,  75610.4       , 101600.4243259 , 148273.79063492,
       105971.97      , 116555.40631579, 110410.56058357, 146012.08637615])

In [238]:
modelos = {'LinReg':LinReg(), 'Lasso':Lasso(), 'Ridge':Ridge(), 'Elastic':ElasticNet(), 'LogReg':LogReg(), 'RFR':RFR(), 
               'ETR':ETR(), 'SVR':SVR(), 'XGBR':XGBR(), 'GBR':GBR(), 'LGBMR':LGBMR()}

In [264]:
ml()

C:\Users\pabli\anaconda3\envs\clase\lib\site-packages\sklearn\linear_model\_logistic.py:818: ConvergenceWarning: lbfgs failed to converge (status=1):
STOP: TOTAL NO. of ITERATIONS REACHED LIMIT.

Increase the number of iterations (max_iter) or scale the data as shown in:
    https://scikit-learn.org/stable/modules/preprocessing.html
Please also refer to the documentation for alternative solver options:
    https://scikit-learn.org/stable/modules/linear_model.html#logistic-regression
  extra_warning_msg=_LOGISTIC_SOLVER_CONVERGENCE_MSG,

optimum model LGBMR min rmse 48913.154575261884

     Modelo          RMSE
0     LGBMR  48913.154575
1   Elastic  50673.823076
2     Ridge  52482.235401
3     Lasso  52630.839669
4    LinReg  52632.239017
5       GBR  53856.461781
6       RFR  55606.196308
7      XGBR  60089.381696
8       ETR  61065.137357
9       SVR  63055.454874
10   LogReg  64821.175279

In [251]:
rfr=RFR()

In [252]:
rfr.fit(X_train, y_train)

RandomForestRegressor()

In [253]:
y_pred=rfr.predict(X_test)

mse(y_test, y_pred, squared=False)

55370.90720266772

In [371]:
for i,e in enumerate(testeo.employee_residence):
    try:
        f = salary[salary.cc==e].salary
        f = int(f)
        testeo.employee_residence[i]=f
    except:
        print(e)

C:\Users\pabli\anaconda3\envs\clase\lib\site-packages\ipykernel_launcher.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """

In [ ]:
for i,e in enumerate(testeo.company_location):
    try:
        f = salary[salary.cc==e].salary
        f = int(f)
        testeo.company_location[i]=f
    except:
        print(e)

In [373]:
from sklearn.preprocessing import StandardScaler

scaler=StandardScaler()

testeo[numeric1]=scaler.fit_transform(testeo[numeric1])

testeo.head()

,work_year,experience_level,employment_type,job_title,salary,salary_currency,employee_residence,remote_ratio,company_location,company_size
0,-1.873027,SE,FT,Machine Learning Scientist,260000,USD,0.134821,-1.608265,0.074734,S
1,-1.873027,MI,FT,Lead Data Analyst,87000,USD,0.717412,0.798509,0.687445,L
2,-1.873027,MI,FT,Data Analyst,85000,USD,0.717412,0.798509,0.687445,L
3,-1.873027,MI,FT,Machine Learning Engineer,299000,CNY,-1.669604,-1.608265,-1.822980,M
4,-1.873027,MI,FT,Product Data Analyst,450000,INR,-2.431974,0.798509,-2.624765,L

In [374]:
for i in testeo.job_title:
    if 'Engineer' in i:
        testeo.job_title.replace({i: 'Data Engineer'}, inplace = True)
    elif 'Analy' in i:
        testeo.job_title.replace({i: 'Data Analyst'}, inplace = True)
    elif 'Architect' in i:
        testeo.job_title.replace({i: 'Data Architect'}, inplace = True)
    elif 'Scien' in i:
        testeo.job_title.replace({i: 'Data Scientist'}, inplace = True)

In [375]:
from sklearn.preprocessing import LabelEncoder

for col in list(testeo.select_dtypes(exclude=["int64", 'float64']).columns):
    testeo[col] = LabelEncoder().fit_transform(testeo[col])
    
testeo

,work_year,experience_level,employment_type,job_title,salary,salary_currency,employee_residence,remote_ratio,company_location,company_size
0,-1.873027,3,1,3,260000,11,0.134821,-1.608265,0.074734,2
1,-1.873027,2,1,0,87000,11,0.717412,0.798509,0.687445,0
2,-1.873027,2,1,0,85000,11,0.717412,0.798509,0.687445,0
3,-1.873027,2,1,2,299000,2,-1.669604,-1.608265,-1.822980,1
4,-1.873027,2,1,0,450000,7,-2.431974,0.798509,-2.624765,0
...,...,...,...,...,...,...,...,...,...,...
102,0.872369,3,1,0,170000,11,0.717412,0.798509,0.687445,1
103,0.872369,3,1,1,192564,11,0.717412,0.798509,0.687445,1
104,0.872369,3,1,3,230000,11,0.717412,0.798509,0.687445,1
105,0.872369,0,1,0,52000,11,-0.184162,-1.608265,-0.260741,1
106,0.872369,3,1,0,129000,11,0.717412,-1.608265,0.687445,1

In [376]:
testeo.drop(columns=["salary","salary_currency"],inplace=True)

In [377]:
testeo

,work_year,experience_level,employment_type,job_title,employee_residence,remote_ratio,company_location,company_size
0,-1.873027,3,1,3,0.134821,-1.608265,0.074734,2
1,-1.873027,2,1,0,0.717412,0.798509,0.687445,0
2,-1.873027,2,1,0,0.717412,0.798509,0.687445,0
3,-1.873027,2,1,2,-1.669604,-1.608265,-1.822980,1
4,-1.873027,2,1,0,-2.431974,0.798509,-2.624765,0
...,...,...,...,...,...,...,...,...
102,0.872369,3,1,0,0.717412,0.798509,0.687445,1
103,0.872369,3,1,1,0.717412,0.798509,0.687445,1
104,0.872369,3,1,3,0.717412,0.798509,0.687445,1
105,0.872369,0,1,0,-0.184162,-1.608265,-0.260741,1
106,0.872369,3,1,0,0.717412,-1.608265,0.687445,1

In [379]:
LGBMR = LGBMR()

In [384]:
LGBMR.fit(X_train, y_train)

LGBMRegressor()

In [385]:
y_pred1 = LGBMR.predict(testeo)

In [387]:
len(y_pred1)

107

In [389]:
testeo['salary_in_usd'] = list(y_pred1)

In [390]:
testeo

,work_year,experience_level,employment_type,job_title,employee_residence,remote_ratio,company_location,company_size,salary_in_usd
0,-1.873027,3,1,3,0.134821,-1.608265,0.074734,2,90424.356532
1,-1.873027,2,1,0,0.717412,0.798509,0.687445,0,165522.553700
2,-1.873027,2,1,0,0.717412,0.798509,0.687445,0,165522.553700
3,-1.873027,2,1,2,-1.669604,-1.608265,-1.822980,1,29049.264223
4,-1.873027,2,1,0,-2.431974,0.798509,-2.624765,0,28887.641235
...,...,...,...,...,...,...,...,...,...
102,0.872369,3,1,0,0.717412,0.798509,0.687445,1,116336.685241
103,0.872369,3,1,1,0.717412,0.798509,0.687445,1,116336.685241
104,0.872369,3,1,3,0.717412,0.798509,0.687445,1,149122.465216
105,0.872369,0,1,0,-0.184162,-1.608265,-0.260741,1,30604.122193
106,0.872369,3,1,0,0.717412,-1.608265,0.687445,1,102722.483865

In [ ]:
list(test.columns)[:8]

In [286]:
space={
    
    'n_estimators':hp.quniform('n_estimators', 10, 1000, 25),  # distribucion uniforme discreta
    
    'learning_rate':hp.uniform('learning_rate', 0.0001, 1.0),# distribucion uniforme continua
    
    'max_depth':hp.quniform('max_depth', 4, 16, 1),
    
    'min_child_weight':hp.quniform('min_child', 1, 10, 1),
    
    'subsample':hp.uniform('subsample', 0.7, 1),
    
    'gamma':hp.uniform('gamma', 0.1, 0.5),
    
    'reg_lambda':hp.uniform('reg_lambda', 0, 1)
}

In [307]:
def ml():
    
    models = {'RFR':{'MODEL':RFR(),'PARAM':{'n_estimators': [10, 50, 100, 150, 200, 500],'max_depth': [1, 5, 10, 15, 20]}},
              'XGB':{'MODEL':XGBR(),'PARAM':{'n_estimators': [10, 50, 100, 150, 200, 500],'max_depth': [1, 5, 10, 15, 20],'learning_rate':[0.001,0.002,0.01,0.05] }}} 
               
    
    rmse = []
    name = []
    dfmodels = pd.DataFrame()
    for m in models:
        x = models[m]["MODEL"]
        p = models[m]["PARAM"]
        y_pred=grid(x,p).predict(X_test)
        MSE = mse(y_test, y_pred, squared=False)
        rmse.append(MSE)
        name.append(m)
    dfmodels['Modelo'] = name
    dfmodels['RMSE'] = rmse
    dfmodels.sort_values("RMSE",ascending=True,inplace=True,ignore_index=True)
    print(f'optimum model {dfmodels.Modelo[0]} rmse {dfmodels.RMSE[0]}')
    return dfmodels

In [324]:
ml()

optimum model XGB rmse 50341.77223791236

  Modelo          RMSE
0    XGB  50341.772238
1    RFR  52461.983420

In [ ]:
 print('Acierto test: {:.2f}'.format(g.score(X_test, y_test)))
    print('Acierto train: {:.2f}'.format(g.score(X_train, y_train)))
    print('Mejores parametros: {}'.format(g.best_params_))
    print('Mejor acierto cv: {:.2f}'.format(g.best_score_))

In [268]:
param={'n_estimators': [10, 50, 100, 150, 200, 500],
       'max_depth': [1, 5, 10, 15, 20]}